<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [3]:
import pandas as pd
import psycopg2

In [4]:
#DBNAME = 'project_sql'
#USER = 'skillfactory'
#PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
#HOST = '84.201.134.129'
#PORT = 5432

In [5]:
connection = psycopg2.connect(
   dbname=DBNAME,
   user=USER,
   host=HOST,
   password=PASSWORD,
   port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [6]:
query_3_1 = f'''select
                    count(*) vacancies_cnt
                from
                    vacancies v 
'''

In [7]:
df_3_1 = pd.read_sql_query(query_3_1, connection)
df_3_1

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\2127050470.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_1 = pd.read_sql_query(query_3_1, connection)

   vacancies_cnt
0          49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [8]:
query_3_2 = f'''select
                    count(*) employers_cnt
                from
                    employers e 
'''

In [9]:
df_3_2 = pd.read_sql_query(query_3_2, connection)
df_3_2

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\2741247974.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_2 = pd.read_sql_query(query_3_2, connection)

   employers_cnt
0          23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [10]:
query_3_3 = f'''select
                    count(*) areas_cnt
                from
                    areas a 
'''

In [11]:
df_3_3 = pd.read_sql_query(query_3_3, connection)
df_3_3

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\3006110907.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_3 = pd.read_sql_query(query_3_3, connection)

   areas_cnt
0       1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [12]:
query_3_4 = f'''select
                    count(*) industries_cnt
                from
                    industries i 
'''

In [13]:
df_3_4 = pd.read_sql_query(query_3_4, connection)
df_3_4

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\764330752.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_4 = pd.read_sql_query(query_3_4, connection)

   industries_cnt
0             294

***

In [14]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [15]:
query_4_1 = f'''select
                    count(*) vacancies_cnt,
                    a.name area
                from
                    vacancies v
                left join areas a on a.id = v.area_id
                group by 2
                order by 1 desc
                limit 5
'''

In [16]:
df_4_1 = pd.read_sql_query(query_4_1, connection)
df_4_1

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\1522353868.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_1 = pd.read_sql_query(query_4_1, connection)

   vacancies_cnt             area
0           5333           Москва
1           2851  Санкт-Петербург
2           2112            Минск
3           2006      Новосибирск
4           1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [17]:
query_4_2 = f'''select
                    count(*) vacancies_cnt
                from
                    vacancies v
                where (v.salary_from is not null) or (v.salary_to is not null)
'''

In [18]:
df_4_2 = pd.read_sql_query(query_4_2, connection)
df_4_2

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\3761913292.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_2 = pd.read_sql_query(query_4_2, connection)

   vacancies_cnt
0          24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [19]:
query_4_3 = f'''select
                    round(avg(v.salary_from)) salary_from_avg,
                    round(avg(v.salary_to)) salary_to_avg
                from
                    vacancies v
'''

In [20]:
df_4_3 = pd.read_sql_query(query_4_3, connection)
df_4_3

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\4169514055.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_3 = pd.read_sql_query(query_4_3, connection)

   salary_from_avg  salary_to_avg
0          71065.0       110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [21]:
query_4_4 = f'''select
                    count(*) vacancies_cnt,
                    v.schedule,
                    v.employment
                from
                    vacancies v
                group by 2,3
                order by 1 desc
                limit 1 offset 1
'''

In [22]:
df_4_4 = pd.read_sql_query(query_4_4, connection)
df_4_4

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\1636312543.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_4 = pd.read_sql_query(query_4_4, connection)

   vacancies_cnt          schedule        employment
0           7802  Удаленная работа  Полная занятость

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [23]:
query_4_5 = f'''select
                    v.experience "Требуемый опыт работы"
                from
                    vacancies v
                group by 1
                order by count(*)
'''

In [24]:
df_4_5 = pd.read_sql_query(query_4_5, connection)
df_4_5

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\802873672.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_5 = pd.read_sql_query(query_4_5, connection)

  Требуемый опыт работы
0           Более 6 лет
1             Нет опыта
2         От 3 до 6 лет
3    От 1 года до 3 лет

***

In [25]:
# выводы по детальному анализу вакансий

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [26]:
query_5_1 = f'''select
                    e.name employer_name
                from
                    employers e
                left join vacancies v on v.employer_id = e.id
                group by 1
                order by count(*) desc
                limit 5 
'''

In [27]:
df_5_1 = pd.read_sql_query(query_5_1, connection)
df_5_1

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\556590240.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_1 = pd.read_sql_query(query_5_1, connection)

   employer_name
0         Яндекс
1     Ростелеком
2       Тинькофф
3           СБЕР
4  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [58]:
query_5_2 = f'''select
                    a.name,
                    count(distinct e.id) employers_cnt,
                    count(distinct v.id) vacancies_cnt 
                from
                    areas a
                left join employers e on a.id = e.area
                left join vacancies v on v.area_id = a.id
                where v.id is null
                group by a.id
                order by 2 desc
'''

In [59]:
df_5_2 = pd.read_sql_query(query_5_2, connection)
df_5_2

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\762398461.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_2 = pd.read_sql_query(query_5_2, connection)

                   name  employers_cnt  vacancies_cnt
0                Россия            410              0
1             Казахстан            207              0
2    Московская область             75              0
3    Краснодарский край             19              0
4    Ростовская область             18              0
..                  ...            ...            ...
588             Скидель              0              0
589          Белоозерск              0              0
590           Орловский              0              0
591          Павловская              0              0
592             Таксимо              0              0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [67]:
query_5_3 = f'''select
                    e.name employer_name,
                    count(distinct a.id) vacancies_cnt
                from
                    employers e
                left join vacancies v on e.id = v.employer_id
                left join areas a on a.id = v.area_id
                group by 1
                order by 2 desc
'''

In [68]:
df_5_3 = pd.read_sql_query(query_5_3, connection)
df_5_3

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\3556584873.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_3 = pd.read_sql_query(query_5_3, connection)

                employer_name  vacancies_cnt
0                      Яндекс            181
1                  Ростелеком            152
2                  Спецремонт            116
3      Поляков Денис Иванович             88
4                   ООО ЕФИН              71
...                       ...            ...
23170                  СДЕЛКА              0
23171            Alandr Group              0
23172                     СДК              0
23173      Lemon Land Lombard              0
23174                  Махина              0

[23175 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [99]:
query_5_4 = f'''select
                    count(*) employers_cnt
                from
                    employers e
                left join employers_industries ei on employer_id = e.id
                where ei.industry_id is null
'''

In [100]:
df_5_4 = pd.read_sql_query(query_5_4, connection)
df_5_4

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\2345892774.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_4 = pd.read_sql_query(query_5_4, connection)

   employers_cnt
0           8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [115]:
query_5_5 = f'''select
                    e.name employer_name
                from
                    employers e
                left join employers_industries ei on employer_id = e.id
                group by 1
                having count(industry_id) = 4
                order by 1
                limit 1 offset 2
'''

In [116]:
df_5_5 = pd.read_sql_query(query_5_5, connection)
df_5_5

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\480638788.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_5 = pd.read_sql_query(query_5_5, connection)

  employer_name
0          2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [140]:
query_5_6 = f'''select
                    count(*) employers_cnt
                from
                    employers_industries ei
                left join industries i on ei.industry_id = i.id
                where i.name like 'Разработка программного обеспечения'         
'''

In [141]:
df_5_6 = pd.read_sql_query(query_5_6, connection)
df_5_6

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\3865320243.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_6 = pd.read_sql_query(query_5_6, connection)

   employers_cnt
0           3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [38]:
# код для получения списка городов-милионников

In [39]:
# текст запроса

In [40]:
# результат запроса

***

In [41]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [150]:
query_6_1 = f'''select
                    count(*) vacancies_cnt
                from
                    vacancies v
                where (lower(v.name) like '%data%') or (lower(v.name) like '%данн%')         
'''

In [151]:
df_6_1 = pd.read_sql_query(query_6_1, connection)
df_6_1

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\1300834887.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_1 = pd.read_sql_query(query_6_1, connection)

   vacancies_cnt
0           1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [222]:
query_6_2 = f'''select
                    count(*)
                from
                    vacancies v
                where (
                (v.name ilike '%data scientist%') or (v.name ilike '%data science%') or (v.name ilike '%исследователь данных%')
                or ((v.name ilike '%ML%')
                and (v.name not ilike '%HTML%'))
                or (v.name ilike '%machine learning%')
                or (v.name ilike '%машинн%обучен%')
                and (v.key_skills is not null)
                )
                and (
                (v.name ilike '%junior%'
                or v.experience ilike '%Нет опыта%'
                or v.employment ilike '%Стажировка%')
                )
'''

In [223]:
df_6_2 = pd.read_sql_query(query_6_2, connection)
df_6_2

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\2048769617.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_2 = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [230]:
query_6_3 = f'''select
                    count(*)
                from
                    vacancies v
                where (
                (v.name ilike '%data scientist%') or (v.name ilike '%data science%') or (v.name ilike '%исследователь данных%')
                or ((v.name ilike '%ML%')
                and (v.name not ilike '%HTML%'))
                or (v.name ilike '%machine learning%')
                or (v.name ilike '%машинн%обучен%')
                and (v.key_skills is not null)
                )
                and (
                (v.key_skills ilike '%SQL%'
                or v.key_skills ilike '%postgres%')    
                )
'''

In [231]:
df_6_3 = pd.read_sql_query(query_6_3, connection)
df_6_3

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\3192746363.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_3 = pd.read_sql_query(query_6_3, connection)

   count
0    229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [232]:
query_6_4 = f'''select
                    count(*)
                from
                    vacancies v
                where (
                (v.name ilike '%data scientist%') or (v.name ilike '%data science%') or (v.name ilike '%исследователь данных%')
                or ((v.name ilike '%ML%')
                and (v.name not ilike '%HTML%'))
                or (v.name ilike '%machine learning%')
                or (v.name ilike '%машинн%обучен%')
                and (v.key_skills is not null)
                )
                and (
                (v.key_skills ilike '%Python%')  
                )
'''

In [233]:
df_6_4 = pd.read_sql_query(query_6_4, connection)
df_6_4

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\1319374162.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_4 = pd.read_sql_query(query_6_4, connection)

   count
0    357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [273]:
query_6_5 = f'''select
                    round(avg(length(v.key_skills)-length(replace(v.key_skills, CHR(9), ''))+1), 2)
                from
                    vacancies v
                where (
                (v.name ilike '%data scientist%') or (v.name ilike '%data science%') or (v.name ilike '%исследователь данных%')
                or ((v.name ilike '%ML%')
                and (v.name not ilike '%HTML%'))
                or (v.name ilike '%machine learning%')
                or (v.name ilike '%машинн%обучен%')
                and (v.key_skills is not null)
                )
'''

In [274]:
df_6_5 = pd.read_sql_query(query_6_5, connection)
df_6_5

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\1566661722.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_5 = pd.read_sql_query(query_6_5, connection)

   round
0   6.55

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [276]:
query_6_6 = f'''select
                    v.experience,
                    round(avg(coalesce((v.salary_from + v.salary_to) / 2, v.salary_from, v.salary_to)), 0) salary_avg
                from vacancies v
                where
                    (v.name ilike '%data scientist%'
                    or v.name ilike '%data science%'
                    or v.name ilike '%исследователь данных%'
                    or (v.name like '%ML%' and v.name not ilike '%HTML%')
                    or v.name ilike '%machine learning%' or v.name ilike '%машинн%обучен%'
                    )
                    and
                    (v.salary_from is not null
                    or v.salary_to is not null)
                    group by v.experience
                
'''

In [279]:
df_6_6 = pd.read_sql_query(query_6_6, connection)
df_6_6

C:\Users\mrlev\AppData\Local\Temp\ipykernel_5372\158571054.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_6 = pd.read_sql_query(query_6_6, connection)

InterfaceError: connection already closed

***

In [54]:
# выводы по предметному анализу

# Общий вывод по проекту

In [55]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

In [278]:
connection.close()